---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalElementPhysicalAsset
source: html/0cc686dd-7bbc-1212-6d69-8b0bc16df7ad.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalElementPhysicalAsset Property

"Physical Material Asset": Used for Analytical Elements.

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalElementPhysicalAsset { get; }
```